Repository: andrewdavidmackenzie/packet
Catalog: po/*.po
Languages: fi

# shortcut window
source: General
fi: Yleiset

# shortcut window
source: Show Shortcuts
fi: Pikanäppäimet

# shortcut window
source: Show Help
fi: Näytä ohje

# shortcut window
source: Open Preferences
fi: Näytä asetukset

# shortcut window
source: Quit
fi: Lopeta

source: _Preferences
fi: _Asetukset

source: _Help
fi: _Apua

source: _Keyboard Shortcuts
fi: _Pikanäppäimet

source: _About Packet
fi: _Tietoja - Packet

source: Setting up Packet…
fi: Packetia valmistellaan…

source: Copy Log
fi: Kopioi loki

source: Couldn't Set Up
fi: Käyttöönotto epäonnistui

source: An error occurred while trying to setup Packet
fi: Packetin määrityksessä tapahtui virhe

source: Try Again
fi: Yritä uudelleen

source: Main Page
fi: Etusivu

source: Add, or drop a file to send
fi: Lisää tai pudota tiedosto lähetettäväksi

source: Add Files
fi: Lisää tiedostoja

source: Selected Files Page
fi: Valitut tiedostot

source: Add File
fi: Lisää tiedosto

source: Send
fi: Lähetä

source: Select Recipients
fi: Valitse vastaanottajat

source: Looking for devices…
fi: Etsitään laitteita…

source: Can't see the other device?
fi: Eikö toinen laite näy?

source: Preferences
fi: Asetukset

source: General
fi: Yleiset

source: Device Name
fi: Laitteen nimi

source: Visibility
fi: Näkyvyys

source: Whether others can see this device
fi: Näkevätkö muut tämän laitteen

source: Downloads Folder
fi: Latauskansio

source: Pick download folder
fi: Valitse latauskansio

source: Run in Background
fi: Suorita taustalla

source: Allow running in the background
fi: Salli suorittaminen taustalla

source: Auto Start
fi: Käynnistä automaattisesti

source: Start automatically at login
fi: Käynnistä sovellus kirjautumisen yhteydessä

source: Advanced
fi: Lisäasetukset

source: Nautilus Plugin
fi: Nautiluksen laajennus

source: Integrate with Nautilus file menu
fi: Integroi nautiluksen tiedostovalikkoon

source: Static Network Port
fi: Staattinen verkkoportti

source: For whitelisting through a firewall
fi: Mahdollistaa pyyntöjen lähettämisen palomuurin läpi

source: Port Number
fi: Portti

source: Help
fi: Apua

source: Make sure both devices are connected to the same Wi-Fi network and have Bluetooth turned on
fi: Varmista, että molemmat laitteet on kytketty samaan Wi-Fi-verkkoon ja Bluetooth on päällä

source: Make sure the device is set to be visible to all nearby devices
fi: Vatmista, että laite näkyy kaikille lähellä oleville

source: For an Android device, try opening the <b>Quick Share</b> page in the <b>Files by Google</b> app
fi: Android-laitteella kokeile avata <b> Quick Share </b> -sivu <b>Files by Google </b> -sovelluksessa

source: translator-credits
fi: Onni Mäkitalo

source: Loading logs...
fi: Ladataan lokeja...

source: Similar Projects
fi: Samanlaiset projektit

source: Failed to retrieve the logs
fi: Lokien nouto epäonnistui

source: Unknown device
fi: Tuntematon laite

source: hour
fi: tunti

source: minute
fi: minuutti

source: second
fi: sekunti

source: Remove
fi: Poista

source: {} File
fi: {} tiedosto

source: Link
fi: Linkki

source: Text
fi: Teksti

source: Receiving
fi: Vastaanotetaan

source: Cancel
fi: Peruuta

source: Incoming Transfer
fi: Saapuva siirto

source: Receiving...
fi: Vastaanotetaan...

source: Decline
fi: Hylkää

source: Accept
fi: Hyväksy

source: {} file ({})
fi: {} tiedosto ({})

source: Preview ({})
fi: Esikatselu ({})

source: Code: {}
fi: Koodi: {}

source: Request timed out
fi: Pyyntö aikakatkaistiin

source: {} wants to share {}
fi: {} haluaa jakaa {}

source: About {} left
fi: Noin {} jäljellä

source: Unexpected dissconnection
fi: Yhteys katkesi yllättäen

source: Transfer cancelled by sender
fi: Lähettääjä perui siirron

source: Copy to clipboard
fi: Kopioi leikepöydälle

source: Save text as file
fi: Tallenna tiedostona

source: Open
fi: Avaa

source: Received "{}"
fi: Vastaanotettu "{}"

source: Copy
fi: Kopioi

source: {} file received
fi: {} tiedosto vastaanotettu

source: Unavailable
fi: Ei saatavilla

source: Queued
fi: Jonossa

source: Retry
fi: Yritä uudelleen

source: Requested
fi: Pyydetty

source: Failed
fi: Epäonnistui

source: Sent {} file
fi: Lähetetty {} tiedosto

source: Couldn't update the Nautilus plugin
fi: Nautiluksen laajennuksen päivitys epäonnistui

source: Packet cannot run in the background
fi: Packetia ei voida suorittaa taustalla

source: Packet cannot run at login
fi: Packetia ei voida käynnistää kirjautumisen yhteydessä

source: Can't rename device during an active transfer
fi: Laitetta ei voi nimetä uudelleen siirron aikana

source: Invalid Port
fi: Portti ei kelpaa

source: The chosen static port "{}" is not available. Try a different port above 1024.
fi: Valittu staattinen portti "{}" ei ole käytettävissä. Yritä muuta porttia, joka on yli 1024.

source: Can't access Downloads folder
fi: Ei pääsyä latauskansioon

source: Pick Folder
fi: Valitse kansio

source: Packet wants to run in the background
fi: Packet haluaa toimia taustalla

source: Plugin Installed
fi: Laajennus asennettu

source: Done
fi: Valmis

source: The plugin was installed successfully, but requires the following packages to function: {}
fi: Laajennus asennettiin onnistuneesti, mutta sen toimintaan tarvitaan seuraavat paketit: {}

source: Package names may vary by distribution, visit <a {}>this link</a> for details.
fi: Pakettien nimet voivat vaihdella jakelun mukaan, katso lisätietoja <a {}>tästä linkistä</a>.

source: Once that's done, restart Nautilus (e.g., by logging out and back in) to load the plugin.
fi: Kun se on tehty, käynnistä Nautilus uudelleen (esim. kirjautumalla ulos ja takaisin sisään), jotta laajennus latautuu.

source: Installation Failed
fi: Asennus epäonnistui

source: Close
fi: Sulje

source: Plugin installation failed. Make sure the following directory exists and is accessible by Packet:
fi: Laajennuksen asentaminen epäonnistui. Varmista, että seuraava hakemisto on olemassa ja Packetilla on siihen käyttöoikeus:

source: Copied log to clipboard
fi: Loki kopioitiin leikepöydälle

source: Ready
fi: Valmis

source: Visible as {:?}
fi: Näkyy nimellä {:?}

source: Invisible
fi: Näkymätön

source: No new devices can share with you
fi: Uudet laitteet eivät voi jakaa tiedostoja kanssasi

source: Disconnected
fi: Yhteys katkaistu

source: Connect to Wi-Fi and turn on Bluetooth
fi: Yhdistä Wi‑Fi-verkkoon ja ota Bluetooth käyttöön

source: Connect to Wi-Fi
fi: Yhdistä Wi‑Fi-verkkoon

source: Turn on Bluetooth
fi: Ota Bluetooth käyttöön

source: Couldn't open files
fi: Tiedostoja ei voitu avata

source: Send with Packet
fi: Lähetä Packetilla

source: Share files easily
fi: Jaa tiedostoja helposti

source: Gnome;GTK;Quick;Nearby;Share;
fi: Gnome;GTK;Quick;Nearby;Share;jako;jaa;

source: Window width
fi: Ikkunan leveys

source: Window height
fi: Ikkunan korkeus

source: Window maximized state
fi: Ikkuna maksimoitu

source: Device name
fi: Laitteen nimi

source: Device visibility
fi: Laitteen näkyvyys

source: Download folder
fi: Latauskansio

source: Send and receive files wirelessly with Android devices using Quick Share or another device with Packet installed.
fi: Lähetä ja vastaanota tiedostoja langattomasti Android-laitteiden kanssa käyttämällä Quick Share -toimintoa tai toiselle laitteelle, johon on asennettu Packet.

source: Packet requires Bluetooth to be enabled and the devices to be connected to a Wi-Fi network with mDNS.
fi: Packet vaatii Bluetoothin olevan käytössä ja laitteiden olevan yhdistettyinä samaan Wi-Fi-verkkoon, jossa on mDNS-tuki.

source: Sent Share Request
fi: Lähetetty jakopyyntö

source: Received Share Request
fi: Vastaanotettu jakopyyntö
